testdata/webhooks/ccbill/refund.json

{
  "clientAccnum": "945280",
  "clientSubacc": "0000",
  "subscriptionId": "0125217202000000017",
  "transactionId": "0125217202000000019",
  "timestamp": "2025-08-05 08:15:22",
  "amount": "23.00",
  "currency": "USD",
  "currencyCode": 840,
  "reason": "Customer requested refund",
  "accountingAmount": "23.00",
  "accountingCurrency": "USD",
  "accountingCurrencyCode": 840
}
